Билет4/src/Documents/НачислениеЗарплаты/НачислениеЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачислениеЗарплаты</name>
  <registerRecords>CalculationRegister.ОсновныеНачисления</registerRecords>
  <registerRecords>CalculationRegister.ДополнительныеНачисления</registerRecords>
  <tabularSections>
    <name>ОсновныеНачисления</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.ОсновныеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>График</name>
      <type>
        <types>CatalogRef.Графики</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеНачисления</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.ДополнительныеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>Процент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Билет4/src/CalculationRegisters/ОсновныеНачисления/ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ОсновныеНачисления</name>
  <periodicity>Month</periodicity>
  <actionPeriod>true</actionPeriod>
  <schedule>InformationRegister.ГрафикиРаботы</schedule>
  <scheduleValue>InformationRegister.ГрафикиРаботы.Resource.Значение</scheduleValue>
  <scheduleDate>InformationRegister.ГрафикиРаботы.Dimension.Дата</scheduleDate>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ОсновныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>График</name>
    <type>
      <types>CatalogRef.Графики</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
    <baseDimension>true</baseDimension>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
    <baseDimension>true</baseDimension>
  </dimensions>
</mdclass:CalculationRegister>

Билет4/src/CalculationRegisters/ДополнительныеНачисления/ДополнительныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ДополнительныеНачисления</name>
  <periodicity>Month</periodicity>
  <basePeriod>true</basePeriod>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ДополнительныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Процент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <recalculations>
    <name>ПерерасчетПремии</name>
    <dimensions>
      <name>Подразделение</name>
    </dimensions>
  </recalculations>
</mdclass:CalculationRegister>

Билет4/src/InformationRegisters/СведенияОСотрудниках/СведенияОСотрудниках.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СведенияОСотрудниках</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Тариф</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>График</name>
    <type>
      <types>CatalogRef.Графики</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Билет4/src/Documents/НачислениеЗарплаты/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ,Режим)
	
	// регистр ОсновныеНачисления
	Движения.ОсновныеНачисления.Записывать = Истина;
	Для Каждого ТекСтрокаОсновныеНачисления из ОсновныеНачисления Цикл
		Движение = Движения.ОсновныеНачисления.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисления.Тариф;
		Движение.ПериодРегистрации = Дата;
		Движение.ПериодДействияНачало = ТекСтрокаОсновныеНачисления.ДатаНачала;
		Движение.ПериодДействияКонец = ТекСтрокаОсновныеНачисления.ДатаОкончания;
		Движение.Сотрудник = ТекСтрокаОсновныеНачисления.Сотрудник;
		Движение.Подразделение = ТекСтрокаОсновныеНачисления.Подразделение;
		Движение.График=ТекСтрокаОсновныеНачисления.График;
	КонецЦикла;

	// регистр ДополнительныеНачисления
	Движения.ДополнительныеНачисления.Записывать = Истина;
	Для Каждого ТекСтрокаДополнительныеНачисленияя из ДополнительныеНачисления Цикл
		Движение = Движения.ДополнительныеНачисления.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ПланыВидовРасчета.ДополнительныеНачисления.Премия;
		Движение.ПериодРегистрации = Дата;
		Движение.БазовыйПериодНачало = НачалоМесяца(ДобавитьМесяц(Дата,-1 ));
		Движение.БазовыйПериодКонец = КонецМесяца(ДобавитьМесяц(Дата,-1 ));
		Движение.Сотрудник = ТекСтрокаДополнительныеНачисленияя.Сотрудник;
		Движение.Подразделение = ТекСтрокаДополнительныеНачисленияя.Подразделение;
		Движение.Процент =ТекСтрокаДополнительныеНачисленияя.Процент;
	КонецЦикла;
	Движения.Записать();
	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОсновныеНачисленияДанныеГрафика.НомерСтроки,
		|	ОсновныеНачисленияДанныеГрафика.График,
		|	ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия
		|ПОМЕСТИТЬ ВременнаяТаблица1
		|ИЗ
		|	РегистрРасчета.ОсновныеНачисления.ДанныеГрафика(Регистратор = &Ссылка) КАК ОсновныеНачисленияДанныеГрафика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблица1.НомерСтроки,
		|	ВременнаяТаблица1.ЗначениеФактическийПериодДействия,
		|	ЕстьNull(СведенияОСотрудникахСрезПоследних.Тариф,0) как Тариф
		|ИЗ
		|	ВременнаяТаблица1 КАК ВременнаяТаблица1
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОСотрудниках.СрезПоследних(&Дата, График В
		|			(ВЫБРАТЬ
		|				ВременнаяТаблица1.График
		|			ИЗ
		|				ВременнаяТаблица1 КАК ВременнаяТаблица1)) КАК СведенияОСотрудникахСрезПоследних
		|		ПО ВременнаяТаблица1.График = СведенияОСотрудникахСрезПоследних.График";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Для каждого СтрокаДвижения из Движения.ОсновныеНачисления Цикл
		Выборка.Сбросить();
		Выборка.НайтиСледующий(СтрокаДвижения.НомерСтроки, "НомерСтроки");
		СтрокаДвижения.Результат = Выборка.ЗначениеФактическийПериодДействия*Выборка.Тариф;
	КонецЦикла;
	Движения.ОсновныеНачисления.Записать();
	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДополнительныеНачисленияБазаОсновныеНачисления.НомерСтроки,
		|	ЕстьNull(ДополнительныеНачисленияБазаОсновныеНачисления.РезультатБаза,0) - ЕстьNull(ДополнительныеНачисленияБазаОсновныеНачисления1.РезультатБаза,0) как РезультатБаза,
		|	ДополнительныеНачисленияБазаОсновныеНачисления.Процент
		|ИЗ
		|	РегистрРасчета.ДополнительныеНачисления.БазаОсновныеНачисления(&ИзмерениеПодразделение, &ИзмерениеПодразделение,,
		|		Регистратор = &Ссылка) КАК ДополнительныеНачисленияБазаОсновныеНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ДополнительныеНачисления.БазаОсновныеНачисления(&ИзмерениеСотрудник,
		|			&ИзмерениеСотрудник,, Регистратор = &Ссылка) КАК ДополнительныеНачисленияБазаОсновныеНачисления1
		|		ПО ДополнительныеНачисленияБазаОсновныеНачисления.НомерСтроки = ДополнительныеНачисленияБазаОсновныеНачисления1.НомерСтроки";
	ИзмерениеСотрудник = новый массив;
	ИзмерениеСотрудник.Добавить("Сотрудник");
	ИзмерениеСотрудник.Добавить("Подразделение");
	Запрос.УстановитьПараметр("ИзмерениеСотрудник", ИзмерениеСотрудник);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	ИзмерениеПодразделение = новый массив;
	ИзмерениеПодразделение.Добавить("Подразделение");
	Запрос.УстановитьПараметр("ИзмерениеПодразделение", ИзмерениеПодразделение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Для каждого СтрокаДвижения из Движения.ДополнительныеНачисления Цикл
		Выборка.Сбросить();
		Выборка.НайтиСледующий(СтрокаДвижения.НомерСтроки, "НомерСтроки");
		СтрокаДвижения.Результат = Выборка.РезультатБаза*Выборка.Процент/100;
	КонецЦикла;
	Движения.ДополнительныеНачисления.Записать();

КонецПроцедуры
